import i18n from "i18next";
import { initReactI18next } from "react-i18next";
import LanguageDetector from "i18next-browser-languagedetector";

const resources = {  
  fa: {
    translation: {
        navBar: {
            home: "خانه",
            about: "درباره ما",
            ourClass: "کلاس‌های ما",
            blog: "وبلاگ",
            media: "رسانه",
            contact: "تماس با ما",
            contact1: "تماس با ما"
        },
        astronomyAboutSection: {
            title: "درباره انجمن نجوم",
            description: "انجمن نجوم افغانستان با هدف ترویج علم نجوم و پرورش نسل نو دانش‌پژوهان، فعالیت خود را از کابل آغاز کرده و امروز با نگاهی آینده‌نگر، در مسیر توسعه علوم فضایی در افغانستان گام برمی‌دارد. این انجمن با برگزاری برنامه‌های آموزشی، رصدهای علمی، دوره‌های حضوری و آنلاین و همکاری با تیم‌های تخصصی، تلاش می‌کند تا علاقه‌مندی جوانان به نجوم را به یک جریان علمی پویا و اثرگذار تبدیل کند.\n\nدر حال حاضر، دو شعبه فعال در کابل به‌عنوان مراکز آموزشی و علمی فعالیت دارند و برنامه‌هایی چون آموزش تکنولوژی فضایی، ساخت موشک و ماهواره، برگزاری سمینارها و توسعه تجهیزات نجومی در دستور کار انجمن قرار دارد. چشم‌انداز بلندمدت انجمن، ایجاد آزمایشگاه‌های پیشرفته فضایی، گسترش همکاری‌های بین‌المللی و حرکت به‌سوی صنعتی‌سازی علوم فضایی در افغانستان است؛ مسیری برای ساختن آینده‌ای روشن‌تر برای نسل جوان کشور."
        },
        hero: {
            badge: "انجمن ستاره‌شناسی افغانستان",
            title: "سفر به دنیای ستاره‌ها، علم و آینده‌ی فضایی افغانستان",
            description: "جایی برای آموزش نجوم، رصد آسمان، پژوهش‌های علمی و رشد علاقه‌مندان جوان به علوم فضایی.",
            searchPlaceholder: "جستجو در برنامه‌ها، مقاله‌ها و رویدادها...",
            searchBtn: "جستجو"
      },
        vision: {
        title: "چشم‌انداز، مأموریت و ارزش‌های ما",
        visionTitle: "چشم‌انداز",
        visionDesc: 'الهام‌بخشی و توانمندسازی نسل بعدی ستاره‌شناسان افغان، با پرورش یک جامعه پویا از علاقه‌مندان به علوم فضایی از طریق برنامه‌های آموزشی، پژوهشی و ترویجی که کنجکاوی، همکاری و برتری علمی را ترویج می‌کند.', 
        missionTitle: "ماموریت",
        missionDesc: "ارائه آموزش نجوم در دسترس، ترویج پژوهش‌های علمی و ایجاد فرصت‌هایی برای جوانان افغان جهت مشارکت در علوم فضایی از طریق کارگاه‌ها، رویدادهای رصدی و پروژه‌های مشترک.",
        valuesTitle: "ارزش‌ها",
        valuesDesc: "شمولیت، کنجکاوی، همکاری، برتری و صداقت ارزش‌های اصلی هستند که راهنمای کار ما در پرورش یک جامعه نجومی پویا در افغانستان هستند."
      },
        Gallery: {
        mainTitle: "چرا ما را انتخاب کنید؟",
          button: "بیشتر بدانید",
        items: [
        {
          title: "اکتشاف کهکشان‌ها",
          desc: "کهکشان‌های دوردست، رازهای کیهانی و کشفیات شگفت‌انگیز میان‌ستاره‌ای را فراتر از تصور انسان کشف کنید."
        },

        {
          title: "سفر در فضا",
          desc: "سفرهای فضایی آینده‌نگرانه را با فناوری پیشرفته سفینه‌ها و ماجراجویی‌های هیجان‌انگیز کیهانی تجربه کنید."
        },

        {
          title: "هوش مصنوعی در فضا",
          desc: "کشف کنید چگونه سیستم‌های هوش مصنوعی مأموریت‌های فضایی، ربات‌های اکتشافی و ناوبری هوشمند را متحول می‌کنند."
        },

        {
          title: "ایستگاه‌های فضایی نسل آینده",
          desc: "ایستگاه‌های مدرن مداری برای تحقیقات اعماق فضا، بقای انسان و محیط‌های زندگی آینده طراحی شده‌اند."
        }

    ]
  },
     features:{
      mainTitle: "آخرین کشفیات",  
      items: [
        
        {
          title: "سیارات فراخورشیدی",
          description: "اکتشاف سیارات خارج از منظومه شمسی."
        },
        {
          title: "تلسکوپ‌های فضایی",
          description: "تلسکوپ‌های مدرن به دانشمندان کمک می‌کنند تا فضا را مطالعه کنند."
        },

        {
          title: "علم کیهانی",
          description: "درک علمی پشت جهان را درک کنید."
        }
      ]
  }  ,
       contact: {
             title: "تماس با ما",
             fullName: "نام شما",
             email: "ایمیل",
            message: "پیام",
             submit: "ارسال",
             nameError: "نام ضروری است",
             emailError: "ایمیل ضروری است",
             messageError: "پیام ضروری است",
        },
        auth: { 
            loginTitle: "ورود به حساب", 
            signupTitle: "ثبت نام", 
            emailPlaceholder: "ایمیل", 
            password: "رمز عبور",  
            login: "ورود", 
            signup: "ثبت نام",
            welcome: "خوش آمدید!", 
            noAccount: "اگر هنوز در سایت ثبت‌نام نکرده‌اید، همین حالا حساب کاربری خود را بسازید.", 
            create: "ثبت نام", 
            haveAccount: "حساب دارید؟", 
            haveAccountText: "اگر قبلاً حساب ساخته‌اید، از این بخش وارد حساب کاربری خود شوید.", 
            firstName: "نام شما", 
            lastName: "نام خانواده گی ",  
            phoneNumber: "شماره تماس", 
            confirmPassword: "تکرار رمز عبور",
             googleLogin: "ورود با گوگل",
            googleLoginSuccess: "ورود با گوگل موفق بود",
            googleLoginFailed: "ورود با گوگل ناموفق بود",

            loginSuccess: "ورود موفق بود",
            loginFailed: "ایمیل یا رمز عبور اشتباه است",

            registerSuccess: "ثبت‌نام موفق بود",
            registerFailed: "ثبت‌نام ناموفق بود",

            networkLoginError: "اتصال به سرور برقرار نشد",
            networkRegisterError: "ثبت‌نام انجام نشد",

            orLoginWith: "همچنین می‌توانید با این روش وارد شوید",
            logout: "خروج", 
        },
        validation: { 
            name: "نام  باید حداقل ۳ حرف باشد", 
            lastName: "نام خانواده گی باید حداقل ۳ حرف باشد", 
            email: "ایمیل درست وارد کنید", 
            password: "رمز عبور باید حداقل ۶ حرف باشد", 
            confirm: "تکرار رمز عبور درست نیست", 
        },
         footer: {
            explore: "دسترسی سریع",
            home: "خانه", 
            class: "کلاس‌های ما",
            media: "رسانه",

            company: "شرکت",
            blog:"وبلاگ",
            aboutUs: "درباره ما",
            contactUs: "تماس با ما",

            subscribe: "اشتراک",
            emailPlaceholder: "ایمیل خود را وارد کنید",
            button: "ارسال",
            emailRequired: "ایمیل الزامی است",
            emailInvalid: "ایمیل معتبر وارد کنید",
        },
         aboutHero: {
          orgName: "انجمن ستاره شناسی افغانستان",
          heroTitle: "کاوش کیهان از افغانستان",
          heroDescription: "ترویج علم نجوم و علوم فضایی در افغانستان از طریق آموزش، پژوهش، برنامه‌های رصدی و الهام‌بخشی به نسل آینده.",
          exploremorebtn: "کاوش بیشتر",
          joinCommbtn : "پیوستن به کمیونیتی"
        },
        aboutStory:{
          title: "از رویا ها تا ستارگان",
          discription1: "انجمن نجوم افغانستان یکی از نخستین حرکت‌های علمی مستقل در افغانستان در حوزه نجوم و علوم فضایی بود.",
          discription2 : " هدف اصلی این انجمن ترویج علم، مبارزه با خرافات و ایجاد امید برای نسل جوان افغانستان بود.",
          discription3 : " امروز این انجمن با مدیریت جدید در تلاش است تا دوباره علم نجوم  را در افغانستان زنده کند."
        },

        AboutMission: {
          misionTitle: "ماموریت ما",
          misiondisc: "ترویج علم نجوم و علوم فضایی در افغانستان از طریق آموزش، برنامه‌های رصدی، فعالیت‌های علمی و پرورش نسل نو پژوهشگران و ستاره‌شناسان جوان.",
          Education: "تعلیم و تربیه",
          edudisc: "ترویج آموزش نجوم در مکاتب، دانشگاه‌ها و جوامع",
          observation: "رصد",
          obsdisc: "تشویق رصدهای عملی و عکاسی نجومی در سراسر کشور",
          commuity: "انجمن",
          commdisc: "ساختن جامعه‌ای قوی از علاقه‌مندان نجوم و ستاره‌شناسان جوان",
          research: "تحقیق",
          researchdisc: "حمایت از پژوهش‌های فضایی و همکاری‌های علمی در سطح بین‌المللی",
          events: "رویداد ها",
          members: "اعضا",
          province: "ولایات",
          researchProject: "پروژه های تحقیقی"
        },

        AboutValues:{
          value: "ارزش ها",
          valuedisc: "ما فعالیت‌های مختلفی در زمینهٔ نجوم و علوم فضایی برگزار می‌کنیم و در آن‌ها شرکت می‌کنیم",
         value1: "آموزش و آگاهی علمی",
         value2: "نوآوری و آینده‌نگری",
         value3: "حمایت از استعدادهای جوان",
         value4: "همکاری و کار تیمی",
         value5: "توسعه پایدار علمی",
         value6: "ایجاد امید و انگیزه برای نسل آینده"
        },

        AboutVisions: {
          vision: "چشم انداز",
          visionDisc:"تبدیل افغانستان به یکی از مراکز فعال علمی و فضایی منطقه ",
          vision1: "ایجاد آزمایشگاه‌های پیشرفته",
          vision2: "توسعه فناوری فضایی",
          vision3: "همکاری‌های بین‌المللی ",
          vision4: " ساخت و پرتاب ماهواره‌های داخلی"
        },
        teamCard: [
        
        {
           id: 1,
          name:"فیروز دانش",
          role: "مدیر انجمن",
          quote : "گاهی به آسمان نگاه می‌کنم و یادم می‌آید انسان فقط برای زندگی کردن به این جهان نیامده است؛ ما آمده‌ایم تا بفهمیم، کشف کنیم و معنای هستی را لمس کنیم. برای من، ستاره‌ها فقط نقطه‌های نورانی نیستند؛ هر کدام پرسشی‌اند درباره جهان، زمان و جایگاه انسان در این کیهان بی‌پایان. من باور دارم بزرگ‌ترین زیبایی انسان، توانایی او در اندیشیدن و فهمیدن ناشناخته‌هاست.",
        },
        {
           id: 2,
          name: " صالحه نبی زاده",
          role: " پژوهشگر",
          quote: "علاقه‌منی من به علم نجوم، انگیزه‌ای شد تا شناخت عمیق‌تری از کیهان و شگفتی‌های بی‌پایان آن به‌دست آورم و دریابم که جهان پیرامون ما تا چه اندازه گسترده و الهام‌بخش است.هدف من این است که این زیبایی‌ها و دانسته‌ها را با دیگران نیز به اشتراک بگذارم و الهام‌بخش افرادی باشم که همچون من، شیفته کشف ناشناخته‌ها و اسرار جهان هستند.بیایید با هم سفری به دنیای ستارگان و کهکشان‌ها آغاز کنیم و تجربه‌هایی فراموش‌نشدنی از عظمت کیهان رقم بزنیم."
        },
        {
           id: 3,
          name: " سهیلا محمدی",
          role: " مربی آموزش",
          quote:"اگر بخواهم صادقانه بگویم، نجوم برای من فقط یک علاقه ساده نیست؛ بیشتر شبیه یک نیاز فکری است. وقتی شب‌ها به آسمان نگاه می‌کنم، ذهنم آرام نمی‌گیرد تا برای این همه سکوت و این همه نظم یک معنی پیدا کند. ستاره‌ها برایم مثل سوال‌هایی‌اند که هیچ وقت تمام نمی‌شوند؛ هر جواب، خودش چند سوال تازه می‌سازد. شاید به همین خاطر است که از نجوم فاصله نمی‌گیرم، چون هر بار که برمی‌گردم به آسمان، احساس می‌کنم هنوز چیزهای زیادی هست که باید بفهمم، و هنوز راه زیادی مانده تا آدم واقعاً بتواند این جهان را درک کند."
        },
        {  
           id: 4,
          name: " شکیب سروری",
          role: " نویسنده مقاله های نجومی",
          quote: "آسمان صفحه بزرگی است كه داستان هاى گذشته را براى ما روايت میكند و در دل هر ستاره سرگذشت هزاران ساله نورى پنهان شده كه هنوز در راه رسيدن است . همه چیز در هستى به هم متصل است ، حتى فاصله ها ، فقط شكل پيوند ها پنهان اند و این جملات اغلب بر كوچکی انسان در برابر عظمت كائنات ، زيبايى ستارگان وحس آرامش يا كنجكاوى در برابر راز هاى دنيا تمركز دارند .ما از گرد و غبار ستاره ها ساخته شده ايم و روزى به آسمان باز خواهيم گشت ."
        },
         {  
           id: 5,
          name: "  سید حسین حسینی",
          role: " عضو",
          quote: "ما فرزندان ستاره‌ها هستیم؛ اتم‌های بدن ما روزی در قلب ستارگان متولد شده‌اند. وقتی انسان به آسمان نگاه می‌کند، در حقیقت به گذشته‌ی خودش خیره شده است؛ به جایی که نور، زمان و هستی برای نخستین‌بار داستان وجود ما را نوشتند."
        },
         {  
           id: 6,
          name: "  علی فرزاد",
          role: " عضو انجمن   ",
          quote: "نجوم فقط مطالعه‌ی ستاره‌ها نیست؛ سفری‌ست برای فهمیدن جایگاه انسان در این جهان بی‌انتها. هر نوری که از اعماق کیهان به چشمان ما می‌رسد، یادآوری می‌کند که حتی در تاریک‌ترین شب‌ها نیز، جهان هنوز در حال سخن گفتن با ماست"
        },
         {  
           id: 7,
          name: "  شبنم هاشمی",
          role: " مقاله نویس",
          quote: "ما فرزندان ستاره‌ها هستیم؛ اتم‌های بدن ما روزی در قلب ستارگان متولد شده‌اند. وقتی انسان به آسمان نگاه می‌کند، در حقیقت به گذشته‌ی خودش خیره شده است؛ به جایی که نور، زمان و هستی برای نخستین‌بار داستان وجود ما را نوشتند"
        },
          {  
           id: 8,
          name: "  زهره محمدی",
          role: " مربی آموزش",
          quote: "آسمان صفحه بزرگی است كه داستان هاى گذشته را براى ما روايت میكند و در دل هر ستاره سرگذشت هزاران ساله نورى پنهان شده كه هنوز در راه رسيدن است . همه چیز در هستى به هم متصل است ، حتى فاصله ها ، فقط شكل پيوند ها پنهان اند و این جملات اغلب بر كوچکی انسان در برابر عظمت كائنات ، زيبايى ستارگان وحس آرامش يا كنجكاوى در برابر راز هاى دنيا تمركز دارند .ما از گرد و غبار ستاره ها ساخته شده ايم و روزى به آسمان باز خواهيم گشت ."
        },
          {  
           id: 9,
          name: " تقی رایا",
          role: "  مدیر سایت",
          quote: "در عصر فناوری، هر خط کد، هر داده و هر مشاهده می‌تواند دریچه‌ای به سوی کشفی تازه باشد. ما باور داریم که کنجکاوی، دانش و نوآوری ابزارهایی هستند که انسان را از زمین فراتر برده‌اند و او را به درک عمیق‌تر از جهان هستی نزدیک‌تر می‌کنند .",

              },
        ],
        blog: {
            featuredPost: "پست ویژه",
            readArticle: "مطالعه مقاله",
            searchPlaceholder: "جستجو در شگفتی‌های فضا...",
            categories: "دسته‌بندی‌ها",
            featuredPosts: "پست‌های ویژه",
            showAll: "مشاهده همه ←",
            close: "بستن ←",
            allPosts: "همه پست‌ها",
            noPosts: "هیچ پستی در این دسته‌بندی پیدا نشد.",
            solarSystem: "منظومه شمسی",
            stars: "ستاره‌گان",
            galaxies: "کهکشان‌ها",
            spaceEvents: "رویدادهای فضایی",
            all: "همه",
            minutesRead: "دقیقه مطالعه",
            writeComment: "نظر خود را بنویسید...",
            noComments: "هنوز نظری ثبت نشده است.",
            posts: {
               title1: "آیا ماه هم زلزله دارد؟ (Moonquakes)",
               description1: `همه‌ٔ ما میدانیم که گاهی روی سیاره زمین لرزه رخ میدهد. ولی آیا سیارات یا قمر های دیگر هم چنین چیزی را تجربه می‌کنند؟ جواب این سوال بله است. مثلا وقتی شب های طولانی و سرد ماه تمام می‌شوند و خورشید دوباره سطح سردش را گرم میکند، انبساط ناگهانی باعث ایجاد لرزش‌ هایی به نام Moonquakes میشود. حتی بعضی از این لرزش ها می‌توانند  تا نیم ساعت طول بکشند!
               ماه‌ لرزه‌ ها چهار نوع اند:
               ✧ عمیق: منظم و مرتبط با کشش ماه
               ✧ کم‌ عمق: قوی‌ ترین نوع و می‌توانند تا نیم ساعت طول بکشند
               ✧ حرارتی: وقتی سطح سرد ماه ناگهان گرم می‌شود
               ✧ برخوردی: به دلیل اصابت شهاب‌ سنگ ها`,
               readTime1: "۳",
               date1: "۲۰۲۶",

               title2: "تلسکوپ فضایی نانسی گریس رومن؛ نسل بعدی نقشه‌برداری کیهان",
               description2: `ناسا در حال تکمیل تلسکوپ نسل بعدی تلسکوپ فضایی نانسی گریس رومن که کار روی آن هنوز جریان دارد طبق برنامه‌ریزی‌های انجام‌شده در سال ۲۰۲۷ میلادی به فضا پرتاب خواهد شد. این پروژه که پیش‌تر با عنوان (WFIRST) شناخته می‌شد، به پاسداشت خدمات ارزنده دکتر نانسی گریس رومن، نخستین مدیر ارشد اخترشناسی ناسا و ملقب به «مادر هابل»، تغییر نام یافت. این تلسکوپ پیشرفته با استقرار در مدار نقطه لاگرانژی ۲ (L2) در فاصله ۱.۵ میلیون کیلومتری زمین، مأموریت اصلی خود را بر شناخت ساختارهای بزرگ‌مقیاس کیهانی، کشف ماهیت انرژی تاریک و ماده تاریک، و همچنین شناسایی سیاره‌های فراخورشیدی متمرکز خواهد کرد. از منظر قابلیت‌های فنی، تلسکوپ رومن مجهز به یک آینه اصلی به قطر ۲.۴ متر است که از نظر اندازه با تلسکوپ فضایی هابل برابری می‌کند؛ با این حال ، این تلسکوپ با مجهز بودن به ابزار فروسرخ میدان وسیع (WFI)،  به تلسکوپ اجازه می‌دهد تا میدانی از آسمان را با وسعت ۱۰۰ برابر بیشتر از میدان دید هابل و با همان کیفیت و وضوح تصویربرداری کند. این ویژگی منحصربه‌فرد، سرعت نقشه‌برداری کهکشان‌ها را به طرز چشمگیری افزایش می‌دهد، به طوری که مأموریت‌های نقشه‌برداری چندساله هابل، توسط تلسکوپ رومن تنها ظرف چند روز با موفقیت به سرانجام می‌رسد.`,
               readTime2: "۶",
               date2: "۲۰۲۷",

               title3: "هم‌نشینی ماه، مشتری و زهره در آسمان شب",
               description3: `امشب پایینتر از ماه به سمت مغرب گفت دو نقطه بسیار روشن می بینید که یکی روشن‌ترین مشتری و پایینتر ازو زهره قراره داره و یک ستاره روشن هم کنار ماه قرار داره که بنام قلب شیر یاد میشه. `,
               readTime3: "۲",
               date3: "۲۴ می ۲۰۲۶",

               title4: "تصویری جدید از سیاه‌چاله مرکزی کهکشان راه شیری",
               description4: `در قلب کهکشان راه شیری ما، سیاه‌چاله‌ای کلان‌جرم به نام Sagittarius A* قرار دارد که توسط گردابی چرخان از گاز و غبار احاطه شده است. مشاهدات جدید نشان می‌دهد که میدان‌های مغناطیسی این سیاه‌چاله، برخلاف تصور قبلی، آشفته نیستند بلکه به‌صورت منظم و هماهنگ سازمان یافته‌اند و ساختاری مارپیچی را شکل می‌دهند که به تنظیم جریان ماده در اطراف سیاه‌چاله کمک می‌کند.
               این میدان‌های مغناطیسی قوی و منظم نقش بسیار مهمی در شکل‌دهی محیط نزدیک به افق رویداد دارند و بر چگونگی شتاب گرفتن، داغ شدن، و تابش ماده تأثیر می‌گذارند. با نقشه‌برداری از این میدان‌ها، دانشمندان به درک بی‌سابقه‌ای از پویایی سیاه‌چاله‌ها، رفتار پلاسمای بسیار داغ، و فرایندهای بنیادی حاکم بر کهکشان‌ها دست پیدا می‌کنند.
               در این دستاورد چشمگیر، ستاره‌شناسان موفق شده‌اند تصویر جدید و خیره‌کننده‌ای از این سیاه‌چالهٔ فوق‌سنگین در قلب کهکشان راه شیری، ثبت کنند. این نمای شگفت‌انگیز که میدان‌های مغناطیسی قوی و بسیار منظم که به‌صورت مارپیچی از لبهٔ سیاه‌چاله بیرون می‌آیند را نشان می‌دهد، برای نخستین‌بار در نور قطبیده مشاهده شده است. این کشف دریچه‌ای است به درون سازوکارهای عمیق ساختار فضا-زمان در اطراف این سامانه‌های با گرانش بسیار قوی و چرخش بالا که در حال به چالش کشیدن بسیاری از تصورات قبلی ما دربارهٔ سیاه‌چاله‌ها و حتی خودِ بافت فضا-زمان است.`,
                readTime4: "۷",
                date4: "۲۰۲۶",

                title5:"چرا ستاره‌ها چشمک می‌زنند؟",
                description5:`وقتی به آسمان شب نگاه می‌کنیم، ستاره‌ها انگار چشمک می‌زنند؛ اما در حقیقت خود ستاره‌ها چشمک نمی‌زنند.
                نور ستاره‌ها هنگام رسیدن به زمین از لایه‌های مختلف جو عبور می‌کند. چون هوای زمین همیشه در حال حرکت است، مسیر               نور کمی تغییر می‌کند و ستاره گاهی پرنور و گاهی کم‌نور دیده می‌شود.
                به همین دلیل ما تصور می‌کنیم ستاره‌ها چشمک می‌زنند.
                نکته:
                سیاره‌ها معمولاً چشمک نمی‌زنند، زیرا به زمین نزدیک‌ترند و نورشان پایدارتر دیده می‌شود ` ,
                readTime5: "۲",
                date5: "۲۰۲۶",

                title6:  "اسرار کهکشان چرخ گاری (Cartwheel Galaxy)",
                description6:  `کهکشان چرخ کارت یکی از عجیب ترین و دیدنی ترین کهکشان هایی است که تاکنون کشف شده است.
                واقع در حدود ۵۰۰ میلیون سال نوری در صورت فلکی مجسمه ساز، این ساختار عظیم کیهانی شبیه یک چرخ درخشان است که در اعماق فضا شناور است - اما شکل غیرمعمول آن در اثر برخورد خشونت آمیز کهکشانی ایجاد شده است.
                . این برخورد امواج شوک عظیمی را که در فضا موج می زنند به بیرون موج می زنند، گاز و گرد و غبار را فشرده و امواج قدرتمند تشکیل ستاره ها را به راه می اندازد.
                نتیجه آن ساختار نفس گیر حلقه ای بود که امروز می بینیم
                حلقه بیرونی روشن کهکشان چرخ کارت پر از ستاره های آبی جوان و نواحی شدید ستاره ساز است، در حالی که مناطق داخلی شامل ستاره های قدیمی تر و بقایایای منحرف شده بازوهای مارپیچی اصلی کهکشان هستند.
                دانشمندان کهکشان هایی مانند چرخ کارت را مطالعه می کنند تا بهتر بفهمند که چگونه برخوردهای عظیم کهکشانی ها را تغییر شکل می دهند، تولد ستاره های جدید را تحریک می کنند و بر تکامل بلند مدت خود جهان تأثیر می گذارند.
                مشاهدات اخیر تلسکوپ فضایی جیمز وب ناسا ابرهای غبار پنهان، ساختارهای پیچیده و فعالیت پرانرژی درون کهکشان را نشان داد که قبلاً در نور معمولی نامرئی بودند و به ستاره شناسان یکی از جزئیات ترین دیدگاه هایی که تاکنون از این برخورد خارق العاده کیهانی ثبت شده اند، داده است.`,
                readTime6: "۶",
                date6: "۲۰۲۶",

                title7: "لایه‌های جو زمین و نقش آن در حفاظت از زندگی",
                description7:  `جوّ زمین لایه‌ای از گازهاست که دور زمین را گرفته و از زندگی محافظت می‌کند.
                 این جو چند لایه دارد:
                 • تروپوسفر: محل آب‌وهوا و زندگی انسان
                 • استراتوسفر: دارای لایه اوزون
                 • مزوسفر: جایی که شهاب‌ها می‌سوزند
                 • خط کارمان: مرز تقریبی آغاز فضا در ۱۰۰ کیلومتری زمین
                 بدون جوّ زمین، زندگی ممکن نبود`,
                readTime7: "۲",
                date7: "۲۰۲۶",

               title8: "ابط‌الجوزا؛ ستاره‌ای در آستانه انفجار کیهانی",
               description8:  `
                ستارهٔ ابط‌الجوزا (Betelgeuse) یکی از مشهورترین و بزرگ‌ترین ستاره‌های آسمان شب است که در صورت فلکی جبار (Orion) قرار                 دارد.
                این ستاره یک ابرغول سرخ است؛ یعنی در مرحلهٔ پایانی زندگی خود قرار دارد.
                 اگر ابط‌الجوزا به جای خورشید قرار می‌گرفت، اندازهٔ آن تا مدار سیارهٔ مشتری می‌رسید!
                 فاصلهٔ آن از زمین حدود ۶۴۰ سال نوری است.
                 دانشمندان باور دارند که این ستاره در آیندهٔ نجومی (شاید هزاران یا حتی صدها هزار سال دیگر) به شکل یک ابرنواختر منفجر                 خواهد شد.
                 تصویری که می‌بینید، یکی از واضح‌ترین تصاویر ثبت‌شده از سطح یک ستاره خارج از منظومهٔ شمسی است؛ جایی که حتی تغییرات سطحی                 و خروج گازهای داغ نیز دیده می‌شود
                `,
                readTime8: "۴",
                date8: "۲۰۲۶",

                title9: "باران در سیارات منظومه شمسی چگونه است؟",
                description9: `باران در سراسر منظومه شمسی کاملاً متفاوت به نظر می رسد - همه چیز به حال و هوای هر جهان بستگی دارد.
                روی زمین، آب مایع است. روی زهره ابرها از اسید سولفوریک ساخته شده اند و باران اسیدی ایجاد می کنند که قبل از لمس سطح آن تبخیر می شود. در مریخ، جو نازک برف تولید می کند که از دی اکسید کربن یخ زده ساخته شده است.
                در غول های گازی مانند مشتری و زحل، فشار شدید حتی ممکن است باران الماس در اعماق اتمسفر آنها ایجاد کند. همچنین اعتقاد بر این است که شرایط مشابهی در اورانوس و نپتون وجود داشته باشد. در پلوتو، متان می تواند در برف یخ بزند، در حالی که عطارد به دلیل کمبود جو باران ندارد.
                همان ایده - بارندگی. دنیاهای کاملا متفاوت `,
                readTime9: "۳",
                date9: "۲۰۲۶",

               title10: "فاصله سیارات از زمین چقدر است؟",
               description10:`فاصله سیارات از زمین واقعیتی که ذهنت را شگفت‌ زده میکند ! تا حالا فکر کردی فاصله ما با سیارات چقدر است ؟ این تصویر نشان میدهد که فاصله‌ ها در منظومه شمسی ثابت نیستند بلکه دائماً تغییر میکنند .
                از نزدیک‌ ترین تا دور ترین :
                (ماه) حدود ۳۶۳ تا ۴۰۶ هزار کیلومتر
                (عطارد) ۷۷ تا ۲۱۶ میلیون کیلومتر
                (زهره) ۳۸ تا ۲۶۱ میلیون کیلومتر
                (مریخ) ۵۵ تا ۴۰۰ میلیون کیلومتر
                (مشتری) ۵۸۸ تا ۹۶۸ میلیون کیلومتر
                (زحل) ۱.۲ تا ۱.۶۵ میلیارد کیلومتر
                (اورانوس) ۲.۶ تا ۳.۱۵ میلیارد کیلومتر
                (نپتون) ۴.۳ تا ۴.۷ میلیارد کیلومتر
                نکته مهم :
                دلیل این تغییر فاصله‌ ها چیست ؟
                چون سیارات در مدار های بیضی به دور خورشید میچرخند گاهی به زمین نزدیک‌ تر و گاهی دورتر میشوند .
                پیام :
                این فاصله‌ ها نشان میدهد که جهان بسیار بزرگتر از چیزی است که تصور میکنیم ، وقتی به آسمان نگاه میکنی یادت باشد هر نقطه نوری دنیایی با فاصله‌ ای باور نکردنی است`,
                readTime10: "۵",
                date10: "۲۰۲۶",

                title11: "چند سیاره در کیهان وجود دارد؟",
                description11:  `تا اوایل دهه‌ی ۱۹۹۰ سیارات شناخته شده توسط انسان فقط محدود به منظومۀ شمسی بود؛ اما اخترشناسان توانستند تا سال 2018 بیشتر از 4500 سیارۀ فراخورشیدی را در کهکشان راه شیری مشاهده و تایید کنند. اما میدانیم که تعداد سیارات در کیهان و سایر کهکشان ها بسیار بسیار بیشتر از این تعداد است. در جهان قابل مشاهده بیش از دو تریلیون کهکشان وجود دارد، در هر کهکشان حدود ۴۰۰ میلیارد ستاره وجود دارد، چند برابر این تعداد هم سیاره و قمر وجود دارد که حداقل تعدادی از آنها می توانند از حیات پشتیبانی کنند، به نظر می رسد تنهایی ما در کیهان امری بعید است`,
                readTime11: "۳",
                date11: "۲۰۲۶",
                title12: "تصویر تاریخی Earthset از پشت ماه توسط آرتمیس ۲",
                description12: `تصویری شگفت انگیز و تاریخی از سمت پشت ماه (به زمین) و سیاره زمین در پس زمینه که توسط فضانوردان آرتمیس ۲ ثبت شده.
                در پدیده‌ی Earthset، زمین به نظر می‌رسد که در پشت افق ماه فرو می‌رود. در این صحنه، یک زمین هلالی که بخشی از آن روشن است، از دید خدمه‌ی فضاپیمای Orion پشت ماه ناپدید می‌شود.
                بخش روشن زمین، ابرهای سفید و آب‌های آبی منطقه‌ی اقیانوسیه را نشان می‌دهد، در حالی که قسمت‌های تاریک در شب فرو رفته‌اند.
                این تصویر همچنین جزئیات فوق‌العاده‌ای از سطح ماه، شامل دهانه‌ها و حوضه‌های هم‌پوشان آن، را به نمایش می‌گذارد.
                این عکس در ساعت ۶:۴۱ عصر به وقت شرق آمریکا در تاریخ ۶ آوریل ۲۰۲۶ ثبت شده، زمانی که فضانوردان Artemis II از پشت سمت پنهان ماه عبور می‌کردند`,        
                readTime12: "۴",
                date12: "۲۰۲۶",

                title13: "ماده تاریک؛ راز نامرئی کیهان",
                description13:`بیش از ۸۰٪ مادهٔ جهان ما مادهٔ تاریک است، ماده‌ای که نور نمی‌دهد و نمی‌توان مستقیم دیدش، اما وجودش را می‌توان از تأثیر گرانشی روی کهکشان‌ها تشخیص داد.
                ماده تاریک باعث می‌شود که ستاره‌ها در کهکشان‌ها با سرعتی حرکت کنند که با جرم قابل مشاهدهٔ آن‌ها قابل توضیح نیست.
                بدون ماده تاریک، کهکشان‌ها از هم پراکنده می‌شدند و شکل پایدارشان حفظ نمی‌شد .
                هنوز ماهیت ماده تاریک ناشناخته است، اما کشف آن می‌تواند راز شکل‌گیری و تکامل کیهان را فاش کند.
                نکته جالب: ما ماده تاریک را نمی‌بینیم، اما می‌توانیم ردپایش را دنبال کنیم و از طریق حرکت ستاره‌ها و خمیدگی نور، یک نقشهٔ نامرئی از جهان بسازیم`,          
                readTime13: "۴",
                date13: "۲۰۲۶",

                title14: "کمربند جبار؛ سه ستاره درخشان آسمان زمستان",
                description14: `سه ستاره که شب های زمستان در آسمان شب کنار هم می بینید مربوط به کمربند صورت فلکی شکارچی (جبار) است؛ سه ستاره درخشان که در یک خط قرار دارند و به نام‌های النطاق، النیلم و مینتاکا شناخته می‌شوند. در نزدیکی این ناحیه، سحابی معروف شکارچی قرار دارد که یکی از فعال‌ترین زایشگاه‌های ستاره‌ ای در کهکشان ماست و در آن ستاره‌های تازه در حال شکل‌ گیری‌ هستند. اطراف این کمربند نیز ستاره‌های بسیار درخشانی مانند رجل‌الجبار و بتلجیوس دیده می‌شوند که هر کدام چندین برابر بزرگ‌تر و پرنورتر از خورشید هستند. این بخش از آسمان یکی از زیباترین و پویاترین نواحی قابل مشاهده با چشم غیرمسلح و تلسکوپ به شمار می‌رود.`,
                readTime14: "۴",
                date14: "۲۰۲۶",

                title15: "بازمانده ابرنواختر ذات‌الکرسی A (Cassiopeia A)",
                description15:  `تصویر روز ناسا
                عنوان: بازمانده ابرنواختر ذات‌الکرسی A
                ستاره‌های بزرگ در کهکشان راه شیری ما زندگی شگفت‌انگیزی دارند. آن‌ها از ابرهای عظیم کیهانی شکل می‌گیرند، هسته‌شان روشن می‌شود و عناصر سنگین را در دل خود می‌سازند. بعد از فقط چند میلیون سال، مواد غنی شده‌شان را با یک انفجار بزرگ به فضا پرتاب می‌کنند و این مواد می‌تواند دوباره شروعی برای شکل‌گیری ستاره‌های جدید باشد. ابر باقی‌مانده‌ای که به ذات‌الکرسی A معروف است، نمونه‌ای از این مرحله پایانی زندگی یک ستاره است. نوری که از انفجار ابرنواختری این بازمانده به وجود آمد، حدود ۳۵۰ سال پیش برای اولین بار در آسمان زمین دیده شد، هرچند رسیدن این نور به ما ۱۱ هزار سال طول کشید. این تصویر واضح که با دوربین NIRCam تلسکوپ فضایی جیمز وب گرفته شده، رشته‌ها و گره‌های داغ باقی‌مانده از این انفجار را نشان می‌دهد. پوسته بیرونی و سفیدرنگی که شبیه دود است و موج انفجار را نشان می‌دهد، حدود ۲۰ سال نوری پهنا دارد `,
                readTime15: "۵",
                date15: "۲۰۲۶",

                title16: "دهانه‌های مسیه روی سطح ماه",
                description16: `بسیاری از سحابی‌ها و خوشه‌های ستاره‌ای در آسمان زمین با نام Charles Messier، ستاره‌شناس مشهور قرن هجدهم، شناخته می‌شوند. نام او همچنین روی این دو دهانه بزرگ و چشمگیر ماه نیز گذاشته شده است.
                دهانه‌های «مسیه» (سمت چپ) و «مسیه A» که در دریای تاریک و صاف باروری ماه یا Mare Fecunditatis قرار دارند، به‌ترتیب ابعادی برابر با ۱۵ در ۸ و ۱۶ در ۱۱ کیلومتر دارند.
                شکل کشیده این دهانه‌ها به‌دلیل برخورد جرمی(کتله‌ای) است که با زاویه‌ای بسیار کم و در مسیری از چپ به راست به سطح ماه برخورد کرده و این حفره‌ها را ایجاد کرده است. این برخورد کم‌زاویه همچنین باعث به‌وجود آمدن دو رگه روشن از مواد پرتاب‌شده شده که در امتداد سطح ماه به سمت راست تصویر ادامه یافته‌اند.
                این تصویر چشمگیر که برای مشاهده با عینک‌های سرخ/آبی طراحی شده است (لنز سرخ برای چشم چپ)، اخیراً از اسکن‌های با وضوح بالای دو عکس (AS11-42-6304 و AS11-42-6305) ساخته شده که طی مأموریت Apollo 11 Moon Landing به ماه ثبت شده بودند.`,
                readTime16: "۵",
                date16: "۹ می ۲۰۲۶",
            },
            

         },
        postDetails: {
            back: "برگشت",
            category: "دسته‌بندی",
            views: "تعداد بازدید",
            notFound: "پست پیدا نشد"
        },
               mediahero:{
          title: "مرکز رسانه یی",
          desc1: " گالری های نجومی, ویدیوهای آموزشی و ",
          desc2: "کتاب های دیجیتالی ویژه را مشاهده کنید " ,
          desc3: "و آگاهی تان را در مورد نجوم, فضا و کهکشان ها افزایش دهید"
        },
        gallerySection:{
          title: "گالری",
          desc: "لحظات زیبای نجوم از انجمن نجوم افغانستان",
          gbtn: "رفتن به گالری"
        },
        videoSection:{
          title: "ویدیو ها",
          desc: "ویدیو ها از چینل یوتیوب نجوم ما",
          vbtn:" مشاهده کانال"
        },
        "videos": {
      "video1": {
          "title": "رصد ماه با تلسکوپ",
         },
          "video2": {
      "title": "  کهکشان راه شیری",
         },
       "video3": {
        "title": "انجمن نجوم افغانستان",
        }
   },
     librarySection:{
    title: "کتابخانه",
    desc: "کتاب هایی از نجوم و علوم فضایی",
    lbtn: "رفتن به کتابخانه",
    vbtn: "نمایش جزییات"
  },
   "books": {
    "book1": {
      "title": "رصد ماه با تلسکوپ",
      "author" : "ستیفن هاوکینگ",
      "Language": "انگلیسی",
      "category": "کیهان شناسی",
      "description": "این کتاب راهنمایی کاربردی برای علاقه‌مندان به رصد ماه و آسمان شب است. خوانندگان با روش‌های مشاهده سطح ماه، شناسایی دهانه‌ها و استفاده صحیح از تلسکوپ آشنا می‌شوند ."
    },
    "book2": {
      "title": "  راهنما ابتدایی نجوم  ",
      "author" : "میکایل سامر ",
      "Language": "انگلیسی",
      "category": " ستاره شناسی",
      "description": "این کتاب مقدمه‌ای جامع برای ورود به دنیای شگفت‌انگیز نجوم است. خوانندگان با مفاهیم پایه، روش‌های رصد آسمان و استفاده از تلسکوپ آشنا می‌شوند و می‌توانند نخستین گام‌های خود را در مطالعه اجرام آسمانی بردارند."
    },
    "book3": {
       "title": "    (ویرایش دوم)نجوم  ",
      "author" : "اندریو فرانکوی ",
      "Language": "انگلیسی",
      "category": " ستاره شناسی",
      "description": " کتاب Astronomy 2e با بیانی روشن و قابل‌فهم برای عموم نگاشته شده و در کنار بهره‌گیری گهگاه از طنز، مجموعه متنوعی از تصاویر و شکل‌های آموزشی را برای روشن‌تر ساختن مفاهیم ارائه می‌دهد."
    },
    
  "book4": {
    "title": "کیهان",
    "author": "کارل ساگان",
    "Language": "انگلیسی",
    "category": "نجوم و کیهان‌شناسی",
    "description": "این کتاب سفری جذاب به تاریخ علم، ساختار جهان و جایگاه انسان در کیهان است. نویسنده با زبانی ساده و الهام‌بخش مفاهیم پیچیده نجوم و کیهان‌شناسی را برای عموم خوانندگان توضیح می‌دهد."
  },

  "book5": {
    "title": "تاریخچه زمان",
    "author": "استیون هاوکینگ",
    "Language": "انگلیسی",
    "category": "کیهان‌شناسی",
    "description": "این کتاب به بررسی منشأ جهان، سیاه‌چاله‌ها، فضا و زمان می‌پردازد. خوانندگان با مهم‌ترین نظریه‌های علمی درباره ساختار و تکامل جهان آشنا می‌شوند."
  },

  "book6": {
    "title": "راهنمای آسمان شب",
    "author": "یان ریدپث",
    "Language": "انگلیسی",
    "category": "رصد و ستاره‌شناسی",
    "description": "این کتاب راهنمایی عملی برای شناسایی صورت‌های فلکی، سیارات و اجرام آسمانی است. علاقه‌مندان می‌توانند با استفاده از آن مهارت‌های رصد آسمان شب را تقویت کنند."
  },

  "book7": {
    "title": "جهان پنهان",
    "author": "لیزا رندال",
    "Language": "انگلیسی",
    "category": "فیزیک و کیهان‌شناسی",
    "description": "این کتاب به بررسی ابعاد پنهان جهان، ماده تاریک و نظریه‌های نوین فیزیک می‌پردازد. نویسنده تلاش می‌کند مفاهیم پیچیده را به شکلی قابل فهم برای خوانندگان توضیح دهد."
  },

  "book8": {
    "title": "سیاره‌ها",
    "author": "برایان کاکس",
    "Language": "انگلیسی",
    "category": "علوم فضایی",
    "description": "این کتاب به معرفی سیاره‌های منظومه شمسی و ویژگی‌های منحصربه‌فرد آن‌ها می‌پردازد. تصاویر زیبا و توضیحات علمی، درک بهتری از همسایگان فضایی زمین ارائه می‌دهد."
  },

  "book9": {
    "title": "کاوش در فضا",
    "author": "جایلز اسپارو",
    "Language": "انگلیسی",
    "category": "فضانوردی",
    "description": "این کتاب تاریخچه اکتشافات فضایی، مأموریت‌های مشهور و فناوری‌های مورد استفاده در سفرهای فضایی را بررسی می‌کند و تصویری جامع از پیشرفت بشر در فضا ارائه می‌دهد."
  },
},
  
    gallery:{
      gtitle: "گالری نجوم",
      gdesc: "با رویدادهای نجومی، رصدها و کشفیات ما همراه شوید.",
      gimgtitle: "گالری تصاویر",
      loadMbtn: "نمایش موارد بیشتر"
    },
    bookPage:{
      title: "کتابخانه نجوم",
      bdesc: "جدیدترین و بهترین کتاب ها را مطالعه و خرید کنید",
      bookcollectiont: "کتابخانه نجوم"
    },
    bookModal:{
      buythis: "اکنون خرید کنید",
      method: "روش پرداخت",
      atomapay: "اتوما پی",
      mtnmomo: "ام تی ان مومو",
      trNumber: "نمبر تراکنش",
      uploadReceipt: "بارگذاری رسید پرداخت",
      submit: "ثبت"
    },
    bookdetails:{
      underReview: "در انتظار تأیید",
      paymentSuccessMessage:
       "رسید پرداخت شما با موفقیت ارسال شد. در حال حاضر توسط مدیر سیستم در حال بررسی است. پس از تأیید، به این کتاب دسترسی خواهید داشت.",
      closebtn: "بستن"
    },
    purchasebtn:{
      buy: "خریدن",
      underReview: "در انتظار تأیید",
      readNow: "اکنون بخوانید"
    },
    pdfreader:{
      loading: " در حال بار گذاری",
      pdfLoadFailed: "خطا در بارگذاری فایل PDF. لطفاً دوباره تلاش کنید."
    },

  }
  },
  en: {
    translation: {
        navBar: {
            home: "Home",
            about: "About",
            ourClass:"Our Class",
            blog: "Blog",
            media: "Media",
            contact: "Contact ",
            contact1: "Contact Us "
        },
        astronomyAboutSection: {
            title: "About the Astronomy Association",
            description: "The Afghanistan Astronomy Association was established in Kabul with the goal of promoting astronomy and inspiring a new generation of science enthusiasts. Today, with a forward-looking vision, the association is taking important steps toward the development of space sciences in Afghanistan. Through educational programs, scientific observation events, online and in-person courses, and collaboration with specialized teams, the association aims to transform young people’s interest in astronomy into a dynamic and impactful scientific movement.\n\nCurrently, two active branches in Kabul serve as educational and scientific centers. The association is working on projects such as space technology education, rocket and satellite construction, scientific seminars, and the development of astronomical equipment. Its long-term vision includes creating advanced space laboratories, expanding international collaborations, and moving toward the industrialization of space sciences in Afghanistan — a path toward building a brighter future for the country’s young generation."
        },
        hero: {
            badge: "Afghanistan Astronomy Association",
            title: "A Journey to the World of Stars, Science, and the Future of Space in Afghanistan",
            description: "A place for astronomy education, sky observation, scientific research, and the growth of young space science enthusiasts.",
            searchPlaceholder: "Search programs, articles, events...",
            searchBtn: "Search"
      },
        vision: {
            title: "Our Vision, Mission, and Values",
            visionTitle: "Vision",
            visionDesc: 'To inspire and empower the next generation of Afghan astronomers, fostering a vibrant community of space science enthusiasts through education, research, and outreach programs that promote curiosity, collaboration, and scientific excellence.',
            missionTitle: "Mission",
            missionDesc: "To provide accessible astronomy education, promote scientific research, and create opportunities for young Afghans to engage with space sciences through workshops, observation events, and collaborative projects.",
            valuesTitle: "Values",
            valuesDesc: "Inclusivity, Curiosity, Collaboration, Excellence, and Integrity are the core values that guide our work in fostering a vibrant astronomy community in Afghanistan."
        },
    Gallery: {
    mainTitle: "Why Choose Us?",
    button: "Learn More",
    items: [
      {
        title: "Exploring Galaxies",
        desc: "Discover distant galaxies, cosmic mysteries, and mind-blowing interstellar discoveries beyond human imagination."
      },

      {
        title: "Space Travel",
        desc: "Experience futuristic space travel with advanced spacecraft technology and thrilling cosmic adventures."
      },

      {
        title: "Artificial Intelligence in Space",
        desc: "Discover how AI systems are revolutionizing space missions, exploratory robots, and intelligent navigation."
      },

      {
        title: "Next-Generation Space Stations",
        desc: "Modern orbital stations designed for deep space research, human survival, and future living environments."
      }
    ]
    },
    features:{
    mainTitle: "Latest Discoveries",
    items: [
      {
        title: "Exoplanets",
        description: "Explore planets outside our solar system."
      },
      {
        title: "Space Telescopes",
        description: "Modern telescopes help scientists study space."
      },
      {
        title: "Cosmic Science",
        description: "Understand the science behind the universe."
      }
    ]
    }, 
    contact: {
        title: "Contact Us",
        fullName: "Full Name",
        email: "E-mail",
         message: "Message",
        submit: "Submit",
        nameError: "Name is required",
        emailError: "Email is required",
        messageError: "Message is required",
    },
    auth: { 
        loginTitle: "Login to Account", 
        signupTitle: "Sign Up", 
        emailPlaceholder: "Email Address",
        password: "Password", forgot: "Forgot your password?", 
        login: "Login", 
        signup: "Sign Up",
        welcome: "Welcome!", 
        noAccount: "If you do not have an account yet, create your account now.", 
        create: "Sign Up", 
        haveAccount: "Already have an account?", 
        haveAccountText: "If you already created an account, login from this section.", 
        firstName: "First Name", 
        lastName: "Last Name", 
        emailAddress: "Email Address", 
        phoneNumber: "Phone Number", 
        confirmPassword: "Confirm Password", 
        googleLogin: "Login with Google",
        googleLoginSuccess: "Google login successful",
        googleLoginFailed: "Google login failed",

        loginSuccess: "Login successful",
        loginFailed: "Invalid email or password",

        registerSuccess: "Registration successful",
        registerFailed: "Registration failed",

        networkLoginError: "Failed to connect to server",
        networkRegisterError: "Failed to register",

        orLoginWith: "Also you are able to login with",
        logout: "Logout" },
        validation: { 
            name: "Name must be at least 3 characters",  
            lastName: "Lastname must be at least 3 characters", 
            email: "Please enter a valid email", 
            password: "Password must be at least 6 characters",
            confirm: "Confirm password does not match", 
        },
         footer: {
             explore: "Explore",
            home: "Home",  
            media: "Media",
            class:"Our Class",
            
            company: "Company",
            aboutUs: "About Us",
            blog: "Blog",
            contactUs: "Contact Us",

            subscribe: "Subscribe",
            emailPlaceholder: "Email address",
            button: "Submit",
            emailRequired: "Email is required",
            emailInvalid: "Please enter a valid email",
        },
         aboutHero: {
          orgName: " Afghanistan Astronomy Society  ",
          heroTitle: "Exploring Universe from Afghanistan",
          heroDescription: "Promoting astronomy and space science in Afghanistan through education, research,observational programs, and inspiring future generation.",
          exploremorebtn: "Explore More",
          joinCommbtn : " Join Community"
        },
         aboutStory:{
          title: "From Dream To The Stars",
          discription1: "The Afghanistan Astronomy Association was one of the first independent scientific movements in Afghanistan in the field of astronomy and space sciences",
          discription2 : " The main goal of this association was to promote science, fight superstition, and create hope for the young generation of Afghanistan",
          discription3 : " Today, under new leadership, the association is striving to revive astronomy in Afghanistan once again."
        },
          AboutMission: {
          misionTitle: "Our Mission",
          misiondisc: "We aim to inspire the next generation by making astronomy accessible to everyone through education, observation, research, and collaboration.",
          Education: " Education ",
          edudisc: "Promoting astronomy education in schools, universities and communities.",
          observation: "observation",
          obsdisc: "Encouraging practical observations and astrophotography across the country.",
          commuity: "Community",
          commdisc: "Building a strong community of astronomy enthusiasts and young astronomers.",
          research: "Research",
          researchdisc: "Supporting space research and scientific collaboration internationally.",
          events: " Events",
          members: "Members",
          province: "Provinces",
          researchProject: " Research Projects "
        },

        AboutValues:{
          value: " Values",
          valuedisc: "We organize and participate in various astronomy and space scienceactivities.",
         value1: "Scientific Education and Awareness",
         value2: "Innovation and Future Vision",
         value3: "Support for Young Talents",
         value4: "Collaboration and Teamwork",
         value5: "Sustainable Scientific Development",
         value6: "Creating Hope and Motivation for Future Generations"
        },

        AboutVisions: {
          vision: " Vision",
          visionDisc:"Transforming Afghanistan into one of the region’s active scientific and space centers through:",
          vision1: "Establishment Of Advanced Laboratories",
          vision2: "Development Of Space Technology",
          vision3: " International Collaborations ",
          vision4: " Voving Toward The Construction And Launch Of Domestic Satellites "
        },
        teamCard: [
  {
    id: 1,
    name: "Firooz Danesh",
    role: "Association Director",
    quote:
      "Sometimes I look at the sky and remember that humanity was not brought into this world merely to live; we are here to understand, to discover, and to touch the meaning of existence. To me, the stars are not just bright points of light; each one is a question about the universe, time, and the place of humanity in this endless cosmos. I believe the greatest beauty of human beings lies in their ability to think and to understand the unknown."
  },
  {
    id: 2,
    name: "Saleha Nabi Zada",
    role: "Researcher",
    quote:
      "My interest in astronomy became a motivation for me to gain a deeper understanding of the universe and its endless wonders, and to realize how vast and inspiring the world around us truly is. My goal is to share these beauties and discoveries with others and inspire people who, like me, are passionate about uncovering the mysteries and secrets of the cosmos. Let us begin a journey together into the world of stars and galaxies and create unforgettable experiences of the greatness of the universe."
  },
  {
    id: 3,
    name: "Sohaila Mohammadi",
    role: "Education Instructor",
    quote:
      "If I want to be honest, astronomy is not just a simple interest for me; it feels more like an intellectual need. When I look at the night sky, my mind cannot rest until it finds meaning in all this silence and order. The stars are like endless questions to me; every answer creates several new questions. Perhaps that is why I never distance myself from astronomy, because every time I return to the sky, I feel there is still so much left to understand, and a long way to go before humanity can truly comprehend this universe."
  },
  {
    id: 4,
    name: "Shakib Sarwari",
    role: "Astronomy Article Writer",
    quote:
      "The sky is a vast page that tells us stories of the past, and within every star lies the hidden tale of ancient light still traveling toward us. Everything in existence is connected, even distances; only the forms of these connections remain unseen. These thoughts often focus on the smallness of humanity before the greatness of the cosmos, the beauty of the stars, and the sense of peace and curiosity in the face of the mysteries of the world. We are made of stardust, and one day we shall return to the sky."
  },
  {
    id: 5,
    name: "Sayed Hussain Hussaini",
    role: "Member",
    quote:
      "We are the children of the stars; the atoms within our bodies were once born in the hearts of stars. When humans look at the sky, they are in fact staring into their own past — to the place where light, time, and existence first wrote the story of our being."
  },
  {
    id: 6,
    name: "Ali Farzad",
    role: "Association Member",
    quote:
      "Astronomy is not merely the study of stars; it is a journey to understand humanity’s place in this infinite universe. Every light that reaches our eyes from the depths of the cosmos reminds us that even in the darkest nights, the universe is still speaking to us."
  },
  {
    id: 7,
    name: "Shabnam Hashimi",
    role: "Article Writer",
    quote:
      "We are the children of the stars; the atoms within our bodies were once born in the hearts of stars. When humans look at the sky, they are in fact staring into their own past — to the place where light, time, and existence first wrote the story of our being."
  },
  {
    id: 8,
    name: " Zuhra Mohammadi",
    role: "Education Instructor",
    quote:
      "The sky is a vast page that tells us stories of the past, and within every star lies the hidden tale of ancient light still traveling toward us. Everything in existence is connected, even distances; only the forms of these connections remain unseen. These thoughts often focus on the smallness of humanity before the greatness of the cosmos, the beauty of the stars, and the sense of peace and curiosity in the face of the mysteries of the world. We are made of stardust, and one day we shall return to the sky."
  },
  {
    id: 9,
    name: "Taqi Raya",
    role: "Site Administrator",
    quote:
      "In the age of technology, every line of code, every piece of data, and every observation can open a gateway to a new discovery. We believe that curiosity, knowledge, and innovation are the tools that have carried humanity beyond the boundaries of Earth and brought us closer to a deeper understanding of the universe.."
  }
],
    blog: {
        featuredPost: "Featured Post",
        readArticle: "Read Article",
        searchPlaceholder: "Search the wonders of space...",
        categories: "Categories",
        featuredPosts: "Featured Posts",
        showAll: "View All →",
        close: "Close ←",
        allPosts: "All Posts",
        noPosts: "No posts found in this category.",
        solarSystem: "Solar System",
        stars: "Stars",
        galaxies: "Galaxies",
        spaceEvents: "Space Events",
        all: "All",
        minutesRead: "min read",
        writeComment: "نظر خود را بنویسید...",
        noComments: "هنوز نظری ثبت نشده است.",
        posts: {
            title1: "Do Moonquakes Exist?",
            description1: `We all know that earthquakes sometimes occur on Earth. But do other planets or moons experience similar events? The answer is yes. For example, when the Moon's long and cold nights come to an end and sunlight begins warming its frozen surface again, the sudden expansion of the lunar crust can create vibrations known as moonquakes. Some of these tremors can even last for up to thirty minutes!

            There are four types of moonquakes:
            ✧ Deep Moonquakes: Regular and linked to the Moon's tidal interactions.
            ✧ Shallow Moonquakes: The strongest type, capable of lasting up to thirty minutes.
            ✧ Thermal Moonquakes: Caused when the Moon's cold surface is suddenly heated by sunlight.
            ✧ Impact Moonquakes: Triggered by meteorite impacts on the lunar surface.`,
            readTime1: "3",
            date1: "2026",

            title2: "Nancy Grace Roman Space Telescope; The Next Generation of Cosmic Surveying",
            description2: `NASA is currently completing its next-generation space observatory, the Nancy Grace Roman Space Telescope, which is scheduled to launch in 2027. Previously known as WFIRST, the mission was renamed in honor of Dr. Nancy Grace Roman, NASA's first Chief of Astronomy and often referred to as the “Mother of Hubble.”

            The Roman Space Telescope will operate from the Sun–Earth Lagrange Point 2 (L2), approximately 1.5 million kilometers from Earth. Its primary mission is to investigate the large-scale structure of the universe, explore the nature of dark energy and dark matter, and discover and study exoplanets.

            From a technical perspective, Roman is equipped with a 2.4-meter primary mirror, matching the size of the Hubble Space Telescope's mirror. However, its Wide Field Instrument (WFI) allows it to capture an area of the sky nearly 100 times larger than Hubble while maintaining comparable image quality and resolution.

            This unique capability will dramatically accelerate galaxy surveys, enabling observations that would take Hubble years to complete to be accomplished by Roman in just a few days.`,
            readTime2: "6",
            date2: "2027",

            title3: "A Conjunction of the Moon, Jupiter, and Venus in the Night Sky",
            description3: `Tonight, if you look toward the western horizon below the Moon, you will notice two exceptionally bright objects. The brighter one is Jupiter, while Venus appears slightly lower in the sky. A bright star can also be seen near the Moon, known as Regulus, often referred to as the “Heart of the Lion.”`,
            readTime3: "2",
            date3: "May 24, 2026",

            title4: "A New Image of the Supermassive Black Hole at the Center of the Milky Way",
            description4: `At the heart of our Milky Way Galaxy lies a supermassive black hole known as Sagittarius A*, surrounded by a swirling disk of gas and dust. New observations reveal that the magnetic fields around this black hole are not chaotic as previously thought, but instead are highly organized and structured, forming spiral patterns that help regulate the flow of matter around it.

            These powerful and well-ordered magnetic fields play a crucial role in shaping the environment near the event horizon, influencing how matter accelerates, heats up, and emits radiation. By mapping these magnetic fields, scientists are gaining unprecedented insights into black hole dynamics, the behavior of extremely hot plasma, and the fundamental processes that govern galaxies.

            In this remarkable achievement, astronomers have captured a stunning new image of the supermassive black hole at the center of the Milky Way. For the first time, the image reveals strong and highly organized magnetic fields emerging in spiral structures from the edge of the black hole, observed through polarized light.

            This discovery opens a new window into the deep mechanisms of spacetime around systems with extremely strong gravity and rapid rotation, challenging many of our previous assumptions about black holes and even the very fabric of spacetime itself.`,
            readTime4: "7",
            date4: "2026",

            title5: "Why Do Stars Twinkle?",
            description5: `When we look at the night sky, stars appear to twinkle; however, stars themselves do not actually flicker. 

            Starlight passes through different layers of Earth's atmosphere before reaching us. Since the air is constantly moving, it bends the light slightly, making the star appear sometimes brighter and sometimes dimmer.

            Because of this effect, we perceive stars as twinkling.

            Note:
            Planets usually do not twinkle as much as stars because they are closer to Earth and their light appears more stable.`,
            readTime5: "2",
            date5: "2026",

            title6: "The Secrets of the Cartwheel Galaxy",
            description6: `The Cartwheel Galaxy is one of the most unusual and fascinating galaxies ever discovered.

            Located about 500 million light-years away in the Sculptor constellation, this enormous cosmic structure resembles a glowing wheel drifting through deep space — but its unusual shape was formed by a violent galactic collision.

            Astronomers believe that around 200 million years ago, a smaller galaxy passed directly through the center of a larger spiral galaxy. This collision created massive shockwaves that rippled outward through space, compressing gas and dust and triggering powerful waves of star formation.

            The result is the breathtaking ring-like structure we see today.

            The bright outer ring of the Cartwheel Galaxy is filled with young blue stars and intense star-forming regions, while the inner regions contain older stars and disrupted remnants of the original spiral arms.

            Scientists study galaxies like the Cartwheel to better understand how massive collisions reshape galaxies, trigger new star birth, and influence the long-term evolution of the universe.

            Recent observations from NASA's James Webb Space Telescope revealed hidden dust clouds, complex structures, and energetic activity inside the galaxy that were previously invisible in normal light, giving astronomers one of the most detailed views ever captured of this extraordinary cosmic collision.`,
            readTime6: "6",
            date6: "2026",

            title7: "Earth’s Atmospheric Layers and Their Role in Protecting Life",
            description7: `Earth’s atmosphere is a layer of gases surrounding our planet that protects life.

            It has several layers:
            • Troposphere: where weather occurs and humans live  
            • Stratosphere: contains the ozone layer  
            • Mesosphere: where meteors burn up  
            • Kármán line: the approximate boundary of space at 100 km above Earth  

            Without Earth's atmosphere, life would not be possible.`,
            readTime7: "2",
            date7: "2026",

            title8: "Betelgeuse; A Star on the Edge of a Cosmic Explosion",
            description8: `Betelgeuse is one of the most famous and largest stars in the night sky, located in the Orion constellation.

            It is a red supergiant, meaning it is in the final stage of its life.

            If Betelgeuse replaced the Sun, its size would extend beyond the orbit of Jupiter!

            It is located about 640 light-years from Earth.

            Scientists believe that in the astronomical future (possibly thousands or even hundreds of thousands of years), it will explode as a supernova.

            The image shows one of the clearest views ever captured of the surface of a star outside our solar system, where surface changes and hot gas emissions can be observed.`,
            readTime8: "4",
           date8: "2026",

            title9: "What Is Rain Like on the Planets of the Solar System?",
            description9: `Rain looks completely different across the Solar System - everything depends on the atmosphere of each world.
            On Earth, water is liquid. On Venus, the clouds are made of sulfuric acid, creating acid rain that evaporates before reaching the surface. On Mars, the thin atmosphere produces snowfall made of frozen carbon dioxide.
            On gas giants like Jupiter and Saturn, extreme pressure may even create diamond rain deep within their atmospheres. Similar conditions are also believed to exist on Uranus and Neptune. On Pluto, methane can freeze into snow, while Mercury has no rain due to the lack of an atmosphere.
            The same idea - precipitation. Completely different worlds`,
            readTime9: "3",
            date9: "2026",

            title10: "How Far Are the Planets from Earth?",
            description10: `A reality that will amaze your mind! Have you ever thought about how far we are from the planets? This image shows that distances in the Solar System are not constant but are constantly changing.
            From closest to farthest:
            (Moon) about 363,000 to 406,000 kilometers
            (Mercury) 77 to 216 million kilometers
            (Venus) 38 to 261 million kilometers
            (Mars) 55 to 400 million kilometers
            (Jupiter) 588 to 968 million kilometers
            (Saturn) 1.2 to 1.65 billion kilometers
            (Uranus) 2.6 to 3.15 billion kilometers
            (Neptune) 4.3 to 4.7 billion kilometers
            Important note:
            Why do these distances change?
            Because planets move in elliptical orbits around the Sun, sometimes they are closer to Earth and sometimes farther away.
            Message:
            These distances show that the universe is much larger than we imagine. When you look at the sky, remember that each point of light is a world at an unimaginable distance`,
            readTime10: "5",
            date10: "2026",

            title11: "How Many Planets Exist in the Universe?",
            description11: `Until the early 1990s, known planets were limited only to our Solar System; but astronomers were able to observe and confirm more than 4,500 exoplanets in the Milky Way galaxy by 2018. However, we know that the number of planets in the universe and other galaxies is far, far greater than this number. In the observable universe there are more than two trillion galaxies, and in each galaxy there are about 400 billion stars. There are even more planets and moons than this, and at least some of them may be able to support life. It seems that our loneliness in the universe is unlikely`,
            readTime11: "3",
            date11: "2026",

            title12: "Historic Earthset Image from Behind the Moon by Artemis 2",
            description12: `A stunning and historic image of the far side of the Moon (facing Earth) with planet Earth in the background, captured by the Artemis 2 astronauts.
            In the Earthset phenomenon, Earth appears to sink behind the lunar horizon. In this scene, a crescent Earth with part of it illuminated disappears from view of the Orion spacecraft crew behind the Moon.
            The bright part of Earth shows white clouds and the blue waters of the Oceania region, while the dark parts are in night.
            This image also reveals extraordinary details of the Moon’s surface, including craters and overlapping basins.
            This photo was taken at 6:41 PM Eastern Time on April 6, 2026, as the Artemis II crew passed behind the far side of the Moon`,
            readTime12: "4",
            date12: "2026",

            title13: "Dark Matter; The Invisible Mystery of the Universe",
            description13: `More than 80% of the matter in our universe is dark matter, a substance that does not emit light and cannot be seen directly, but its existence can be detected through its gravitational effects on galaxies.
            Dark matter causes stars in galaxies to move at speeds that cannot be explained by the visible mass alone.
            Without dark matter, galaxies would fall apart and would not remain stable in their structure.
            The nature of dark matter is still unknown, but discovering it could reveal the secrets of the formation and evolution of the universe.
            Interesting note: We cannot see dark matter, but we can trace its effects and, through the motion of stars and the bending of light, create an invisible map of the universe`,
            readTime13: "4",
            date13: "2026",

            title14: "Orion’s Belt; Three Bright Stars of the Winter Sky",
            description14: `The three stars you see close together in the winter night sky belong to the constellation Orion’s Belt; three bright stars that lie in a straight line and are known as Alnitak, Alnilam, and Mintaka. Near this region lies the famous Orion Nebula, one of the most active star-forming regions in our galaxy where new stars are being born. Around this belt, very bright stars such as Rigel and Betelgeuse can also be seen, each many times larger and brighter than the Sun. This part of the sky is one of the most beautiful and dynamic regions visible to the naked eye and through telescopes.`,
            readTime14: "4",
            date14: "2026",

            title15: "Cassiopeia A Supernova Remnant",
            description15: `NASA’s Picture of the Day
            Title: Cassiopeia A Supernova Remnant
            Massive stars in our Milky Way live remarkable lives. They form from vast cosmic clouds, ignite their cores, and produce heavy elements. After only a few million years, they eject their enriched material into space through a massive explosion, and this material can become the starting point for new stars. The remnant known as Cassiopeia A is an example of this final stage of a star’s life. The light from this supernova explosion was first seen from Earth about 350 years ago, although it took 11,000 years for the light to reach us. This clear image, taken by the NIRCam instrument of the James Webb Space Telescope, shows the hot filaments and knots left behind by the explosion. The outer white shell, which looks like smoke and represents the shock wave, is about 20 light-years across`,
            readTime15: "5",
            date15: "2026",

            title16: "Messier Craters on the Surface of the Moon",
            description16: `Many nebulae and star clusters in the sky are named after Charles Messier, the famous 18th-century astronomer. His name has also been given to these two large and striking craters on the Moon.
            The craters “Messier” (left) and “Messier A,” located in the dark and smooth Mare Fecunditatis, measure 15 by 8 kilometers and 16 by 11 kilometers respectively.
            The elongated shape of these craters is due to an object striking the lunar surface at a very low angle from left to right, creating these formations. This low-angle impact also produced two bright streaks of ejected material extending across the lunar surface to the right side of the image.
            This remarkable image, designed for viewing with red/blue glasses (red lens for the left eye), was created from high-resolution scans of two photos (AS11-42-6304 and AS11-42-6305) taken during the Apollo 11 Moon Landing mission`,
            readTime16: "5",
            date16: "May 9, 2026",
        }

    },
    postDetails: {
        back: "Back",
        category: "Category",
        views: "Views",
        notFound: "Post not found"
    },
      mediahero: {
  title: "Media Center",
  desc1: "Explore astronomy galleries, educational videos, and",
  desc2: "exclusive digital books",
  desc3: "to expand your knowledge about astronomy, space, and galaxies."
},

gallerySection: {
  title: "Gallery",
  desc: "Beautiful astronomy moments from the Afghanistan Astronomy Association",
  gbtn: "Go to Gallery"
},

videoSection: {
  title: "Videos",
  desc: "Videos from our astronomy YouTube channel",
  vbtn: "View Channel"
},

videos: {
  video1: {
    title: "Observing the Moon with a Telescope"
  },
  video2: {
    title: "The Milky Way Galaxy"
  },
  video3: {
    title: "Afghanistan Astronomy Association"
  }
},

librarySection: {
  title: "Library",
  desc: "Books on Astronomy and Space Science",
  lbtn: "Go to Library",
  vbtn: "View Details"
},

books: {
  book1: {
    title: "Observing the Moon with a Telescope",
    author: "Stephen Hawking",
    Language: "English",
    category: "Cosmology",
    description: "This book is a practical guide for astronomy enthusiasts interested in observing the Moon and the night sky. Readers will learn methods for studying the lunar surface, identifying craters, and using telescopes effectively."
  },

  book2: {
    title: "Beginner's Guide to Astronomy",
    author: "Michael Summer",
    Language: "English",
    category: "Astronomy",
    description: "This book provides a comprehensive introduction to the fascinating world of astronomy. Readers will learn fundamental concepts, sky observation techniques, and how to use telescopes as they take their first steps into studying celestial objects."
  },

  book3: {
    title: "Astronomy (Second Edition)",
    author: "Andrew Fraknoi",
    Language: "English",
    category: "Astronomy",
    description: "Astronomy 2e is written in a clear and accessible style for general readers. It occasionally incorporates humor and includes a wide variety of educational images and illustrations to help explain astronomical concepts."
  },

  book4: {
    title: "Cosmos",
    author: "Carl Sagan",
    Language: "English",
    category: "Astronomy and Cosmology",
    description: "This book takes readers on a fascinating journey through the history of science, the structure of the universe, and humanity's place within it. The author explains complex astronomical and cosmological concepts in an inspiring and accessible way."
  },

  book5: {
    title: "A Brief History of Time",
    author: "Stephen Hawking",
    Language: "English",
    category: "Cosmology",
    description: "This book explores the origins of the universe, black holes, space, and time. Readers are introduced to some of the most important scientific theories about the structure and evolution of the cosmos."
  },

  book6: {
    title: "Guide to the Night Sky",
    author: "Ian Ridpath",
    Language: "English",
    category: "Observational Astronomy",
    description: "This practical guide helps readers identify constellations, planets, and celestial objects. It is an excellent resource for improving night-sky observation skills."
  },

  book7: {
    title: "Hidden Universe",
    author: "Lisa Randall",
    Language: "English",
    category: "Physics and Cosmology",
    description: "This book explores hidden dimensions of the universe, dark matter, and modern theories of physics. The author presents challenging scientific concepts in a way that is understandable to a broad audience."
  },

  book8: {
    title: "The Planets",
    author: "Brian Cox",
    Language: "English",
    category: "Space Science",
    description: "This book introduces the planets of our solar system and their unique characteristics. Rich imagery and scientific explanations provide a deeper understanding of Earth's neighboring worlds."
  },

  book9: {
    title: "Exploring Space",
    author: "Giles Sparrow",
    Language: "English",
    category: "Astronautics",
    description: "This book examines the history of space exploration, famous missions, and the technologies used in space travel, offering a comprehensive overview of humanity's progress in exploring the cosmos."
  }
},

gallery: {
  gtitle: "Astronomy Gallery",
  gdesc: "Join us in exploring astronomical events, observations, and discoveries.",
  gimgtitle: "Image Gallery",
  loadMbtn: "Load More"
},

bookPage: {
  title: "Astronomy Library",
  bdesc: "Read and purchase the latest and best astronomy books",
  bookcollectiont: "Astronomy Library"
},

bookModal: {
  buythis: "Buy This Book",
  method: "Payment Method",
  atomapay: "Atoma Pay",
  mtnmomo: "MTN MoMo",
  trNumber: "Transaction Number",
  uploadReceipt: "Upload Payment Receipt",
  submit: "Submit"
},

bookdetails: {
  underReview: "Under Review",
  paymentSuccessMessage: "Your payment receipt has been submitted successfully. It is currently being reviewed by the administrator. You will be able to access this book after approval.",
  closebtn: "Close"
},

purchasebtn: {
  buy: "Buy",
  underReview: "Under Review",
  readNow: "Read Now"
},

pdfreader: {
  loading: "Loading...",
  pdfLoadFailed: "Failed to load PDF file. Please try again."
},


    }
  },
};

i18n
  .use(LanguageDetector)
  .use(initReactI18next)
  .init({
    resources,
    lng: "fa",
    fallbackLng: "fa", 
    interpolation: {
      escapeValue: false,
    },
  });
export default i18n;