export const productPost = [
   {
        id: 1,
        category: "solarSystem",
        title: "آیا ماه هم زلزله دارد؟ (Moonquakes)",
        readTime: "۳ ",
        featured: true,
        views: 120,
        desc: `همه‌ٔ ما میدانیم که گاهی روی سیاره زمین لرزه رخ میدهد. ولی آیا سیارات یا قمر های دیگر هم چنین چیزی را تجربه می‌کنند؟ جواب این سوال بله است. مثلا وقتی شب های طولانی و سرد ماه تمام می‌شوند و خورشید دوباره سطح سردش را گرم میکند، انبساط ناگهانی باعث ایجاد لرزش‌ هایی به نام Moonquakes میشود. حتی بعضی از این لرزش ها می‌توانند  تا نیم ساعت طول بکشند!
         ماه‌ لرزه‌ ها چهار نوع اند:
         ✧ عمیق: منظم و مرتبط با کشش ماه
          ✧ کم‌ عمق: قوی‌ ترین نوع و می‌توانند تا نیم ساعت طول بکشند
         ✧ حرارتی: وقتی سطح سرد ماه ناگهان گرم می‌شود
         ✧ برخوردی: به دلیل اصابت شهاب‌ سنگ ها`,
        date: "۲۰۲۶",
        image: "/Astronomy/assets/images/img1.webp",
        likes: 0,
        comments: []
    },
    {
        id: 2,
        category: "spaceEvents",
        title: "تلسکوپ فضایی نانسی گریس رومن؛ نسل بعدی نقشه‌برداری کیهان",
        readTime: "۶ ",
        featured: true,
        views: 10,
        desc: `ناسا در حال تکمیل تلسکوپ نسل بعدی
        تلسکوپ فضایی نانسی گریس رومن که کار روی آن هنوز جریان دارد طبق برنامه‌ریزی‌های انجام‌شده در سال ۲۰۲۷ میلادی به فضا پرتاب خواهد شد. این پروژه که پیش‌تر با عنوان (WFIRST) شناخته می‌شد، به پاسداشت خدمات ارزنده دکتر نانسی گریس رومن، نخستین مدیر ارشد اخترشناسی ناسا و ملقب به «مادر هابل»، تغییر نام یافت. این تلسکوپ پیشرفته با استقرار در مدار نقطه لاگرانژی ۲ (L2) در فاصله ۱.۵ میلیون کیلومتری زمین، مأموریت اصلی خود را بر شناخت ساختارهای بزرگ‌مقیاس کیهانی، کشف ماهیت انرژی تاریک و ماده تاریک، و همچنین شناسایی سیاره‌های فراخورشیدی متمرکز خواهد کرد. از منظر قابلیت‌های فنی، تلسکوپ رومن مجهز به یک آینه اصلی به قطر ۲.۴ متر است که از نظر اندازه با تلسکوپ فضایی هابل برابری می‌کند؛ با این حال ، این تلسکوپ با مجهز بودن به ابزار فروسرخ میدان وسیع (WFI)،  به تلسکوپ اجازه می‌دهد تا میدانی از آسمان را با وسعت ۱۰۰ برابر بیشتر از میدان دید هابل و با همان کیفیت و وضوح تصویربرداری کند. این ویژگی منحصربه‌فرد، سرعت نقشه‌برداری کهکشان‌ها را به طرز چشمگیری افزایش می‌دهد، به طوری که مأموریت‌های نقشه‌برداری چندساله هابل، توسط تلسکوپ رومن تنها ظرف چند روز با موفقیت به سرانجام می‌رسد.`,
        date: "۲۰۲۷",
        image: "/Astronomy/assets/images/img2.webp",
        likes: 0,
        comments: []
    },
    {
        id: 3,
        category: "spaceEvents",
        title: "هم‌نشینی ماه، مشتری و زهره در آسمان شب",
        readTime: "۲",
        featured: false,
        views: 12,
        desc: `امشب پایینتر از ماه به سمت مغرب گفت دو نقطه بسیار روشن می بینید که یکی روشن‌ترین مشتری و پایینتر ازو زهره قراره داره و یک ستاره روشن هم کنار ماه قرار داره که بنام قلب شیر یاد میشه. `,
        date: "۲۴ می ۲۰۲۶",
        image:"/Astronomy/assets/images/img3.webp",
        likes: 0,
       comments: []
    },
    {
        id: 4,
        category: "galaxies",
        title: "تصویری جدید از سیاه‌چاله مرکزی کهکشان راه شیری",
        readTime: "۷ ",
        featured: true,
        views: 100,
        desc: `در قلب کهکشان راه شیری ما، سیاه‌چاله‌ای کلان‌جرم به نام Sagittarius A* قرار دارد که توسط گردابی چرخان از گاز و غبار احاطه شده است. مشاهدات جدید نشان می‌دهد که میدان‌های مغناطیسی این سیاه‌چاله، برخلاف تصور قبلی، آشفته نیستند بلکه به‌صورت منظم و هماهنگ سازمان یافته‌اند و ساختاری مارپیچی را شکل می‌دهند که به تنظیم جریان ماده در اطراف سیاه‌چاله کمک می‌کند.
        این میدان‌های مغناطیسی قوی و منظم نقش بسیار مهمی در شکل‌دهی محیط نزدیک به افق رویداد دارند و بر چگونگی شتاب گرفتن، داغ شدن، و تابش ماده تأثیر می‌گذارند. با نقشه‌برداری از این میدان‌ها، دانشمندان به درک بی‌سابقه‌ای از پویایی سیاه‌چاله‌ها، رفتار پلاسمای بسیار داغ، و فرایندهای بنیادی حاکم بر کهکشان‌ها دست پیدا می‌کنند.
         در این دستاورد چشمگیر، ستاره‌شناسان موفق شده‌اند تصویر جدید و خیره‌کننده‌ای از این سیاه‌چالهٔ فوق‌سنگین در قلب کهکشان راه شیری، ثبت کنند. این نمای شگفت‌انگیز که میدان‌های مغناطیسی قوی و بسیار منظم که به‌صورت مارپیچی از لبهٔ سیاه‌چاله بیرون می‌آیند را نشان می‌دهد، برای نخستین‌بار در نور قطبیده مشاهده شده است. این کشف دریچه‌ای است به درون سازوکارهای عمیق ساختار فضا-زمان در اطراف این سامانه‌های با گرانش بسیار قوی و چرخش بالا که در حال به چالش کشیدن بسیاری از تصورات قبلی ما دربارهٔ سیاه‌چاله‌ها و حتی خودِ بافت فضا-زمان است.`,
        date: "۲۰۲۶",
        image:"/Astronomy/assets/images/img4.webp",
        likes: 0,
       comments: []
    },
    {
        id: 5,
        category: "stars",
        title: "چرا ستاره‌ها چشمک می‌زنند؟",
        readTime: "۲",
        featured: false,
        views: 120,
        desc: `وقتی به آسمان شب نگاه می‌کنیم، ستاره‌ها انگار چشمک می‌زنند؛ اما در حقیقت خود ستاره‌ها چشمک نمی‌زنند.
        نور ستاره‌ها هنگام رسیدن به زمین از لایه‌های مختلف جو عبور می‌کند. چون هوای زمین همیشه در حال حرکت است، مسیر نور کمی تغییر می‌کند و ستاره گاهی پرنور و گاهی کم‌نور دیده می‌شود.
        به همین دلیل ما تصور می‌کنیم ستاره‌ها چشمک می‌زنند.
        نکته:
        سیاره‌ها معمولاً چشمک نمی‌زنند، زیرا به زمین نزدیک‌ترند و نورشان پایدارتر دیده می‌شود `,
        date: "۲۰۲۶",
        image: "/Astronomy/assets/images/img5.webp",
        likes: 0,
        comments: []
    },
    {
    id: 6,
    category: "galaxies",
    title: "اسرار کهکشان چرخ گاری (Cartwheel Galaxy)",
    readTime: "۶ ",
    featured: true,
    views: 20,
    desc: `کهکشان چرخ کارت یکی از عجیب ترین و دیدنی ترین کهکشان هایی است که تاکنون کشف شده است.
واقع در حدود ۵۰۰ میلیون سال نوری در صورت فلکی مجسمه ساز، این ساختار عظیم کیهانی شبیه یک چرخ درخشان است که در اعماق فضا شناور است - اما شکل غیرمعمول آن در اثر برخورد خشونت آمیز کهکشانی ایجاد شده است.
اخترشناسان معتقدند که حدود 200 میلیون سال پیش یک کهکشان کوچکتر مستقیما از مرکز کهکشان مارپیچی بزرگ عبور کرده است. این برخورد امواج شوک عظیمی را که در فضا موج می زنند به بیرون موج می زنند، گاز و گرد و غبار را فشرده و امواج قدرتمند تشکیل ستاره ها را به راه می اندازد.
نتیجه آن ساختار نفس گیر حلقه ای بود که امروز می بینیم
حلقه بیرونی روشن کهکشان چرخ کارت پر از ستاره های آبی جوان و نواحی شدید ستاره ساز است، در حالی که مناطق داخلی شامل ستاره های قدیمی تر و بقایایای منحرف شده بازوهای مارپیچی اصلی کهکشان هستند.
دانشمندان کهکشان هایی مانند چرخ کارت را مطالعه می کنند تا بهتر بفهمند که چگونه برخوردهای عظیم کهکشانی ها را تغییر شکل می دهند، تولد ستاره های جدید را تحریک می کنند و بر تکامل بلند مدت خود جهان تأثیر می گذارند.
مشاهدات اخیر تلسکوپ فضایی جیمز وب ناسا ابرهای غبار پنهان، ساختارهای پیچیده و فعالیت پرانرژی درون کهکشان را نشان داد که قبلاً در نور معمولی نامرئی بودند و به ستاره شناسان یکی از جزئیات ترین دیدگاه هایی که تاکنون از این برخورد خارق العاده کیهانی ثبت شده اند، داده است.`,
    date: "۲۰۲۶",
    image: "/Astronomy/assets/images/img6.webp",
    likes: 0,
    comments: []
  },

{
id: 7,
category: "solarSystem",
title: "لایه‌های جو زمین و نقش آن در حفاظت از زندگی",
readTime: "۲ ",
featured: false,
views: 20,
desc: `جوّ زمین لایه‌ای از گازهاست که دور زمین را گرفته و از زندگی محافظت می‌کند.
این جو چند لایه دارد:
• تروپوسفر: محل آب‌وهوا و زندگی انسان
• استراتوسفر: دارای لایه اوزون
• مزوسفر: جایی که شهاب‌ها می‌سوزند
• خط کارمان: مرز تقریبی آغاز فضا در ۱۰۰ کیلومتری زمین

بدون جوّ زمین، زندگی ممکن نبود
`,
date: "۲۰۲۶",
image: "/Astronomy/assets/images/img7.webp",
likes: 0,
comments: []
},

{
id: 8,
category: "stars",
title: "ابط‌الجوزا؛ ستاره‌ای در آستانه انفجار کیهانی",
readTime: "۴ ",
featured: true,
views: 140,
desc: `
ستارهٔ ابط‌الجوزا (Betelgeuse) یکی از مشهورترین و بزرگ‌ترین ستاره‌های آسمان شب است که در صورت فلکی جبار (Orion) قرار دارد.

این ستاره یک ابرغول سرخ است؛ یعنی در مرحلهٔ پایانی زندگی خود قرار دارد.
 اگر ابط‌الجوزا به جای خورشید قرار می‌گرفت، اندازهٔ آن تا مدار سیارهٔ مشتری می‌رسید!
 فاصلهٔ آن از زمین حدود ۶۴۰ سال نوری است.
 دانشمندان باور دارند که این ستاره در آیندهٔ نجومی (شاید هزاران یا حتی صدها هزار سال دیگر) به شکل یک ابرنواختر منفجر خواهد شد.

 تصویری که می‌بینید، یکی از واضح‌ترین تصاویر ثبت‌شده از سطح یک ستاره خارج از منظومهٔ شمسی است؛ جایی که حتی تغییرات سطحی و خروج گازهای داغ نیز دیده می‌شود
`,
date: "۲۰۲۶",
image:"/Astronomy/assets/images/img8.webp",
likes: 0,
comments: []
},

{
id: 9,
category: "solarSystem",
title: "باران در سیارات منظومه شمسی چگونه است؟",
readTime: "۳",
featured: false,
views: 110,
desc: `باران در سراسر منظومه شمسی کاملاً متفاوت به نظر می رسد - همه چیز به حال و هوای هر جهان بستگی دارد.

روی زمین، آب مایع است. روی زهره ابرها از اسید سولفوریک ساخته شده اند و باران اسیدی ایجاد می کنند که قبل از لمس سطح آن تبخیر می شود. در مریخ، جو نازک برف تولید می کند که از دی اکسید کربن یخ زده ساخته شده است.

در غول های گازی مانند مشتری و زحل، فشار شدید حتی ممکن است باران الماس در اعماق اتمسفر آنها ایجاد کند. همچنین اعتقاد بر این است که شرایط مشابهی در اورانوس و نپتون وجود داشته باشد. در پلوتو، متان می تواند در برف یخ بزند، در حالی که عطارد به دلیل کمبود جو باران ندارد.

همان ایده - بارندگی. دنیاهای کاملا متفاوت 
`,
date: "۲۰۲۶",
image: "/Astronomy/assets/images/img9.webp",
likes: 0,
comments: []
},

{
id: 10,
category: "solarSystem",
title: "فاصله سیارات از زمین چقدر است؟",
readTime: "۵",
featured: true,
views: 14,
desc: `فاصله سیارات از زمین واقعیتی که ذهنت را شگفت‌ زده میکند ! تا حالا فکر کردی فاصله ما با سیارات چقدر است ؟ این تصویر نشان میدهد که فاصله‌ ها در منظومه شمسی ثابت نیستند بلکه دائماً تغییر میکنند .
از نزدیک‌ ترین تا دور ترین :
(ماه) حدود ۳۶۳ تا ۴۰۶ هزار کیلومتر

(عطارد) ۷۷ تا ۲۱۶ میلیون کیلومتر

(زهره) ۳۸ تا ۲۶۱ میلیون کیلومتر

(مریخ) ۵۵ تا ۴۰۰ میلیون کیلومتر

(مشتری) ۵۸۸ تا ۹۶۸ میلیون کیلومتر

(زحل) ۱.۲ تا ۱.۶۵ میلیارد کیلومتر

(اورانوس) ۲.۶ تا ۳.۱۵ میلیارد کیلومتر

(نپتون) ۴.۳ تا ۴.۷ میلیارد کیلومتر

نکته مهم :
دلیل این تغییر فاصله‌ ها چیست ؟
چون سیارات در مدار های بیضی به دور خورشید میچرخند گاهی به زمین نزدیک‌ تر و گاهی دورتر میشوند .
پیام :
این فاصله‌ ها نشان میدهد که جهان بسیار بزرگتر از چیزی است که تصور میکنیم ، وقتی به آسمان نگاه میکنی یادت باشد هر نقطه نوری دنیایی با فاصله‌ ای باور نکردنی است`,
date: "۲۰۲۶",
image:"/Astronomy/assets/images/img10.webp",
likes: 0,
comments: []
},

{
id: 11,
category: "galaxies",
title: "چند سیاره در کیهان وجود دارد؟",
readTime: "۳ ",
featured: false,
views: 13,
desc: `تا اوایل دهه‌ی ۱۹۹۰ سیارات شناخته شده توسط انسان فقط محدود به منظومۀ شمسی بود؛ اما اخترشناسان توانستند تا سال 2018 بیشتر از 4500 سیارۀ فراخورشیدی را در کهکشان راه شیری مشاهده و تایید کنند. اما میدانیم که تعداد سیارات در کیهان و سایر کهکشان ها بسیار بسیار بیشتر از این تعداد است. در جهان قابل مشاهده بیش از دو تریلیون کهکشان وجود دارد، در هر کهکشان حدود ۴۰۰ میلیارد ستاره وجود دارد، چند برابر این تعداد هم سیاره و قمر وجود دارد که حداقل تعدادی از آنها می توانند از حیات پشتیبانی کنند، به نظر می رسد تنهایی ما در کیهان امری بعید است
`,
date: "۲۰۲۶",
image: "/Astronomy/assets/images/img11.webp",
likes: 0,
comments: []
},

{
id: 12,
category: "spaceEvents",
title: "تصویر تاریخی Earthset از پشت ماه توسط آرتمیس ۲",
readTime: "۴ ",
featured: true,
views: 10,
desc: `تصویری شگفت انگیز و تاریخی از سمت پشت ماه (به زمین) و سیاره زمین در پس زمینه که توسط فضانوردان آرتمیس ۲ ثبت شده.

در پدیده‌ی Earthset، زمین به نظر می‌رسد که در پشت افق ماه فرو می‌رود. در این صحنه، یک زمین هلالی که بخشی از آن روشن است، از دید خدمه‌ی فضاپیمای Orion پشت ماه ناپدید می‌شود.

بخش روشن زمین، ابرهای سفید و آب‌های آبی منطقه‌ی اقیانوسیه را نشان می‌دهد، در حالی که قسمت‌های تاریک در شب فرو رفته‌اند.

این تصویر همچنین جزئیات فوق‌العاده‌ای از سطح ماه، شامل دهانه‌ها و حوضه‌های هم‌پوشان آن، را به نمایش می‌گذارد.

این عکس در ساعت ۶:۴۱ عصر به وقت شرق آمریکا در تاریخ ۶ آوریل ۲۰۲۶ ثبت شده، زمانی که فضانوردان Artemis II از پشت سمت پنهان ماه عبور می‌کردند
`,
date: "۲۰۲۶",
image: "/Astronomy/assets/images/img12.webp",
likes: 0,
comments: []
},

{
id: 13,
category: "galaxies",
title: "ماده تاریک؛ راز نامرئی کیهان",
readTime: "۴",
featured: false,
views: 15,
desc: `
بیش از ۸۰٪ مادهٔ جهان ما مادهٔ تاریک است، ماده‌ای که نور نمی‌دهد و نمی‌توان مستقیم دیدش، اما وجودش را می‌توان از تأثیر گرانشی روی کهکشان‌ها تشخیص داد.

ماده تاریک باعث می‌شود که ستاره‌ها در کهکشان‌ها با سرعتی حرکت کنند که با جرم قابل مشاهدهٔ آن‌ها قابل توضیح نیست.
بدون ماده تاریک، کهکشان‌ها از هم پراکنده می‌شدند و شکل پایدارشان حفظ نمی‌شد.
هنوز ماهیت ماده تاریک ناشناخته است، اما کشف آن می‌تواند راز شکل‌گیری و تکامل کیهان را فاش کند.

 نکته جالب: ما ماده تاریک را نمی‌بینیم، اما می‌توانیم ردپایش را دنبال کنیم و از طریق حرکت ستاره‌ها و خمیدگی نور، یک نقشهٔ نامرئی از جهان بسازیم
`,
date: "۲۰۲۶",
image: "/Astronomy/assets/images/img13.webp",
likes: 0,
comments: []
},

{
id: 14,
category: "stars",
title: "کمربند جبار؛ سه ستاره درخشان آسمان زمستان",
readTime: "۴ ",
featured: false,
views: 14,
desc: `سه ستاره که شب های زمستان در آسمان شب کنار هم می بینید مربوط به کمربند صورت فلکی شکارچی (جبار) است؛ سه ستاره درخشان که در یک خط قرار دارند و به نام‌های النطاق، النیلم و مینتاکا شناخته می‌شوند. در نزدیکی این ناحیه، سحابی معروف شکارچی قرار دارد که یکی از فعال‌ترین زایشگاه‌های ستاره‌ ای در کهکشان ماست و در آن ستاره‌های تازه در حال شکل‌ گیری‌ هستند. اطراف این کمربند نیز ستاره‌های بسیار درخشانی مانند رجل‌الجبار و بتلجیوس دیده می‌شوند که هر کدام چندین برابر بزرگ‌تر و پرنورتر از خورشید هستند. این بخش از آسمان یکی از زیباترین و پویاترین نواحی قابل مشاهده با چشم غیرمسلح و تلسکوپ به شمار می‌رود.
`,
date: "۲۰۲۶",
image: "/Astronomy/assets/images/img14.webp",
likes: 0,
comments: []
},{
id: 15,
category: "galaxies",
title: "بازمانده ابرنواختر ذات‌الکرسی A (Cassiopeia A)",
readTime: "۵ ",
featured: false,
views: 10,
desc: `تصویر روز ناسا
عنوان: بازمانده ابرنواختر ذات‌الکرسی A
ستاره‌های بزرگ در کهکشان راه شیری ما زندگی شگفت‌انگیزی دارند. آن‌ها از ابرهای عظیم کیهانی شکل می‌گیرند، هسته‌شان روشن می‌شود و عناصر سنگین را در دل خود می‌سازند. بعد از فقط چند میلیون سال، مواد غنی شده‌شان را با یک انفجار بزرگ به فضا پرتاب می‌کنند و این مواد می‌تواند دوباره شروعی برای شکل‌گیری ستاره‌های جدید باشد. ابر باقی‌مانده‌ای که به ذات‌الکرسی A معروف است، نمونه‌ای از این مرحله پایانی زندگی یک ستاره است. نوری که از انفجار ابرنواختری این بازمانده به وجود آمد، حدود ۳۵۰ سال پیش برای اولین بار در آسمان زمین دیده شد، هرچند رسیدن این نور به ما ۱۱ هزار سال طول کشید. این تصویر واضح که با دوربین NIRCam تلسکوپ فضایی جیمز وب گرفته شده، رشته‌ها و گره‌های داغ باقی‌مانده از این انفجار را نشان می‌دهد. پوسته بیرونی و سفیدرنگی که شبیه دود است و موج انفجار را نشان می‌دهد، حدود ۲۰ سال نوری پهنا دارد `,
date: "۲۰۲۶",
image:"/Astronomy/assets/images/img15.webp",
likes: 0,
comments: []
},
{
  id: 16,
  category: "solarSystem",
  title: "دهانه‌های مسیه روی سطح ماه",
  readTime: "۵ ",
featured: true,
views: 120,
  desc: `
بسیاری از سحابی‌ها و خوشه‌های ستاره‌ای در آسمان زمین با نام Charles Messier، ستاره‌شناس مشهور قرن هجدهم، شناخته می‌شوند. نام او همچنین روی این دو دهانه بزرگ و چشمگیر ماه نیز گذاشته شده است.
دهانه‌های «مسیه» (سمت چپ) و «مسیه A» که در دریای تاریک و صاف باروری ماه یا Mare Fecunditatis قرار دارند، به‌ترتیب ابعادی برابر با ۱۵ در ۸ و ۱۶ در ۱۱ کیلومتر دارند.
شکل کشیده این دهانه‌ها به‌دلیل برخورد جرمی(کتله‌ای) است که با زاویه‌ای بسیار کم و در مسیری از چپ به راست به سطح ماه برخورد کرده و این حفره‌ها را ایجاد کرده است. این برخورد کم‌زاویه همچنین باعث به‌وجود آمدن دو رگه روشن از مواد پرتاب‌شده شده که در امتداد سطح ماه به سمت راست تصویر ادامه یافته‌اند.
این تصویر چشمگیر که برای مشاهده با عینک‌های سرخ/آبی طراحی شده است (لنز سرخ برای چشم چپ)، اخیراً از اسکن‌های با وضوح بالای دو عکس (AS11-42-6304 و AS11-42-6305) ساخته شده که طی مأموریت Apollo 11 Moon Landing به ماه ثبت شده بودند.`,
  date: "۹ می ۲۰۲۶",
  image:"/Astronomy/assets/images/img16.webp",
  likes: 0,
comments: []
}

];